import React from "react";

const TermsAndConditions = () => {
  return (
    <div>
      <div className="bg-blue-800 mt-16 mb-4">
        <h1 className="text-3xl font-bold text-right lg:pr-20 pr-5 h-full py-10  text-white">
          الشروط والأحكام
        </h1>
      </div>

      <div className="max-w-7xl mx-auto px-4 py-8 text-right" dir="rtl">
        <div className="prose prose-lg max-w-none space-y-6">
          <p className="text-right font-semibold text-2xl">
            يرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام موقع الويب
            https://bisharh.com وتطبيق الهاتف المحمول الخاص بمنصة بشارة. يعتمد
            وصولك إلى المنصة واستخدامها على موافقتك على هذه الشروط والتزامك بها.
            تنطبق هذه الشروط على جميع الزوار والمستخدمين والأشخاص الآخرين الذين
            يدخلون إلى المنصة أو يستخدمونها. من خلال الوصول إلى المنصة أو
            استخدامها، فإنك توافق على الالتزام بهذه الشروط. إذا كنت لا توافق على
            أي جزء من الشروط، فلن تتمكن من استخدام المنصة.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4">
            السياسات الإضافية
          </h2>
          <p>
            يرجى مراجعة سياسة خصوصية بشارة للحصول على معلومات وإشارات حول تجميع
            واستخدام معلوماتك بواسطة بشارة.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4">التعاريف</h2>
          <ul className="list-disc list-inside space-y-2 mr-6">
            <li>
              يشير مصطلح &quot;المنصة&quot; إلى موقع الويب https://bisharh.com
              وتطبيقات IOS / Android المحمولة.
            </li>
            <li>
              يشير مصطلح &quot;الاستفسار&quot; إلى أي استفسار أو سؤال يتم تسليمه
              عن طريق المنصة.
            </li>
            <li>
              يشير مصطلح &quot;المستخدم&quot; إلى شخص أو منظمة تستخدم المنصة لأي
              غرض.
            </li>
            <li>
              يشير مصطلح &quot;عضو&quot; إلى فرد أو مؤسسة تقبل الشروط وتنشئ
              حسابًا باسم مستخدم وكلمة السر.
            </li>
            <li>
              يشير مصطلح &quot;العميل&quot; إلى العضو الذي قام بالتسجيل في
              المنصة للتصفح وإرسال استفسارات أو أسئلة.
            </li>
            <li>
              يشير مصطلح &quot;مزود الخدمة&quot; إلى العضو الذي قام بالتسجيل على
              المنصة كمحامٍ للإجابة على الاستفسارات والأسئلة.
            </li>
            <li>
              يشير مصطلح &quot;طلب استفسار&quot; إلى طلب مقدم من العميل لإحالة
              الاستفسار إلى مزود الخدمة.
            </li>
            <li>
              يشير مصطلح &quot;إجابة الإستفسار&quot; إلى المعلومات التي يضيفها
              مزود الخدمة إلى الاستفسار.
            </li>
            <li>
              يشير مصطلح &quot;إحالة الاستفسار&quot; إلى نقل معلومات الاستفسار
              إلى مزود الخدمة.
            </li>
            <li>
              يشير مصطلح &quot;رسوم إحالة الاستفسار&quot; إلى المبلغ الذي يجب
              على مزود الخدمة دفعه إلى بشارة من أجل إحالة استفسار.
            </li>
            <li>
              يشير مصطلح &quot;الرصيد على بشارة&quot; إلى المبلغ المالي الذي
              يمتلكه مقدم الخدمة على البرنامج ليتمكن من إحالة استفسار.
            </li>
          </ul>

          <h2 className="text-2xl font-semibold mt-8 mb-4">
            إنشاء الحساب واستخدام المنصة
          </h2>
          <p>
            بشارة هي منصة تقنية تتيح للعملاء العثور على مزودي الخدمة المعتمدين
            والتواصل معهم لتقديم استفسارات قانونية. تعمل منصة بشارة كوسيط تقني
            يتيح للمستخدمين التواصل مع مزودي الخدمة المسجلين. ومع ذلك، فإن بشارة
            لا تتحمل أي مسؤولية عن صحة المؤهلات المهنية أو القانونية للأفراد
            الذين يسجلون كمزودي خدمة. يتحمل كل مزود خدمة المسؤولية الكاملة عن
            صحة بياناته، بما في ذلك حصوله على التراخيص والتصاريح المطلوبة
            لممارسة الاستشارات القانونية. كما أن العميل هو المسؤول عن التحقق من
            أهلية مزود الخدمة قبل الاعتماد على أي استشارة مقدمة عبر المنصة. في
            حال تبين أن أي مستخدم قدَّم نفسه على أنه محامٍ أو مستشار قانوني دون
            أن يكون مؤهلًا قانونيًا، فإن بشارة تخلي مسؤوليتها عن أي أضرار أو
            تبعات قد تنتج عن ذلك، ويحتفظ المتضررون بحق اتخاذ الإجراءات القانونية
            المناسبة ضد الطرف المخالف.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4">
            سياسات المحتوى والمراقبة
          </h2>
          <p>
            على الرغم من أن بشارة ليست ملزمة بالقيام بذلك، إلا أنها تحتفظ بالحق
            في مراقبة أو فحص أو ضمان دقة أو جودة أو ملاءمة أو سلامة أي محتوى
            مستخدم موجود أو مقدم على المنصة لأي سبب من الأسباب. بشارة هي وسيط
            تقني وليس عليها أي التزام بالتحقيق في محتوى المستخدم وقانونيته.
            تحتفظ بشارة بالحق في حظر الوصول إلى المحتوى ذي الصلة أو إزالته أو
            إلغاء حساب عضو ذي صلة في أي وقت دون إشعار مسبق لمحتوى المستخدم الذي
            ينتهك الشروط أو يضر بالمنصة والمستخدمين والأعضاء.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4">
            المدفوعات والرسوم
          </h2>
          <p>
            فيما يتعلق باستخدام منصة بشارة، قد تفرض بشارة بعض الرسوم (رسوم إحالة
            الاستفسار). يقوم مزودو الخدمة بتسديد المدفوعات إلى بشارة من أجل
            الوصول إلى العملاء وإحالة الاستفسارات. يمكن لمزودي الخدمة تحويل
            الأموال إلى أرصدة بشارة عن طريق بطاقات الائتمان أو بطاقات مدفوعة
            مسبقًا. يمكن لمزودي الخدمة تلقي الاستفسارات من العملاء والتواصل
            معهم، وستكون هناك رسوم متعلقة بإحالة الاستفسار. يقر مقدمو الخدمة
            ويوافقون على أن بشارة لا تضمن صفقة عمل لأي إحالة استفسار. يحق للعميل
            اختيار مزود الخدمة الذي يرغب في العمل معه دون أي التزام مسبق. في حال
            حدوث أي من هذه الحالات، لا يمكن لمزود الخدمة طلب استرداد رسوم إحالة
            الاستفسار.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4">
            حل النزاعات والمسؤولية
          </h2>
          <p>
            تقدر بشارة عملاءها ومزودي الخدمة وتتفهم أن النزاعات قد تحدث أحيانًا
            بين هذه الأطراف. يقر جميع الأعضاء ويوافقون على أن بشارة ليست ملزمة
            بالمشاركة أو حل أي نزاع بين الأعضاء أو مع أي طرف ثالث. يحق للعميل
            رفض العمل مع أي مزود خدمة واختيار المزود الذي يرغب في التعامل معه
            دون أي التزام مسبق.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4">
            روابط لمواقع أخرى
          </h2>
          <p>
            قد تحتوي منصتنا على روابط لمواقع أو منصات تابعة لجهات خارجية لا
            تملكها أو تتحكم فيها بشارة. لا تتحكم بشارة ولا تتحمل أي مسؤولية عن
            محتويات أو سياسات الخصوصية أو ممارسات أي موقع ويب أو نظام أساسي تابع
            لجهة خارجية. نوصي بشدة بقراءة الشروط والأحكام وسياسات الخصوصية لأي
            موقع ويب أو برنامج تابع لجهة خارجية تقوم بزيارته.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4">
            حقوق الملكية الفكرية
          </h2>
          <p>
            تمتلك بشارة ملكية وترخيص جميع حقوق الملكية الفكرية للمواد المرئية
            والمكتوبة المنشورة في المنصة. بشارة هي علامة تجارية مسجلة، وتنتمي
            جميع حقوق هذه العلامة التجارية إلى اسم مجال بشارة وجميع المجالات
            والمجالات الفرعية ذات الصلة في أي مجال على المنصة وأي شعار آخر
            وعلامة خدمة واسم تجاري و/أو علامة تجارية لمالكيها أو المرخصين لها.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4">
            إنهاء الحساب والوصول إلى المنصة
          </h2>
          <p>
            يجوز لنا إنهاء أو تعليق الوصول إلى منصتنا على الفور دون التزام
            بتقديم إشعار مسبق لأي سبب، بما في ذلك انتهاك الشروط أو الإخلال
            بأحكام الملكية الفكرية أو مخالفة سياسات الاستخدام. عند إنهاء حسابك،
            سيتوقف حقك في استخدام المنصة فورًا.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4">
            القانون وصلاحية الشروط
          </h2>
          <p>
            تخضع هذه الشروط وتُفسر وفقًا لقوانين المملكة العربية السعودية
            باستثناء تعارض أحكام القوانين. لن يشكل فشلنا في تنفيذ أي من أحكام أو
            حقوق هذه الشروط تنازلاً عنها. إذا أصبحت أيًا من هذه الشروط غير صالحة
            أو غير قابلة للتنفيذ، فستظل الشروط المتبقية سارية دون أن تتأثر.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4">اتصل بنا</h2>
          <p>
            إذا كانت لديك أي أسئلة حول هذه الشروط، فيرجى الاتصال بنا عن طريق
            إرسال بريد إلكتروني إلى{" "}
            <a
              href="mailto:support@bisharh.com"
              className="text-blue-600 hover:text-blue-800"
            >
              support@bisharh.com
            </a>
          </p>
        </div>
      </div>
    </div>
  );
};

export default TermsAndConditions;
