import React from "react";

const PrivacyPolicy = () => {
  return (
    <div>
      <div className="bg-blue-800 my-16 ">
        <h1 className="text-3xl font-bold text-right lg:pr-20 pr-5 h-full py-10  text-white">
          سياسة الخصوصية
        </h1>
      </div>

      <div
        className="max-w-7xl mx-auto px-4 lg:px-10 pb-8 text-right"
        dir="rtl"
      >
        <div className="prose prose-lg max-w-none space-y-6">
          <p className="text-right font-semibold text-2xl">
            تقوم مؤسسة بشارة يقين للخدمات التجارية، أو أي من الشركات التابعة لها
            (المشار إليها مجتمعة بـ "بشارة" أو "نحن" أو "المنصة")، بجمع معلومات
            عنك عند استخدام منصتنا الإلكترونية، أو تطبيقات الهاتف المحمول، أو
            الاستفادة من أي من منتجاتنا وخدماتنا الأخرى (يُشار إليها مجتمعة بـ
            "الخدمات"). توضح سياسة الخصوصية هذه الأسس التي تعتمد عليها بشارة في
            معالجة المعلومات، بما في ذلك البيانات الشخصية التي نقوم بجمعها منك
            أو تلك التي تزودنا بها. من خلال الوصول إلى المنصة أو استخدام الخدمات
            أو تقديم أي معلومات لنا، فإنك توافق تلقائيًا على الممارسات الموضحة
            في هذه السياسة.
          </p>

         
          <p>
            يُشار إلى مستخدمي المنصة بـ ("المستخدمين"، "العميل") سواء قد
            استفادوا من إحدى خدماتها أم اكتفوا بإنشاء حساب. كما يُشار إلى
            المسجلين في المنصة كمحامين بـ "المحامي" أو "مزود الخدمة". أما العميل
            الذي قام بمجرد التسجيل في المنصة فيُشار إليه بـ "العميل".
          </p>

          
          <p>
            عزيزي العميل، عند إتمامك لعملية التسجيل، فإنك تقر بموافقتك على
            الشروط والأحكام، بالإضافة إلى سياسة الخصوصية الخاصة بجمع واستخدام
            بياناتك المسجلة على المنصة أو من خلال أي من مقدمي الخدمات الخارجيين.
            يشمل ذلك استخدام بياناتك حتى في حال عدم استعراضك لكامل تفاصيل
            السياسة أثناء التسجيل.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4">جمع المعلومات</h2>
          <p>
            نقوم بجمع المعلومات التي تقدمها عند استخدامك المنصة، مثل إنشاء أو
            تعديل حسابك، طلب خدمة، أو التواصل معنا. قد تشمل هذه المعلومات: اسمك،
            تاريخ ميلادك، البريد الإلكتروني، رقم الجوال، العنوان، صورة الملف
            الشخصي، طريقة الدفع، والبيانات المالية.
          </p>
          <p>
            لا نجمع أو نخزن معلومات الأطفال دون 18 عامًا، ونطلب من المستخدمين
            التأكيد بأنهم بعمر 18 عامًا أو أكثر عند التسجيل.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4">
            معلومات نقوم بجمعها من خلال استخدامك لخدماتنا
          </h2>
          <p>
            عند استخدامك للمنصة، نقوم بجمع البيانات الشخصية، والتي تشمل معلومات
            يمكن استخدامها للتواصل معك مباشرة، مثل: الاسم الكامل، العنوان
            البريدي، رقم الهاتف، البريد الإلكتروني، ومعلومات الدفع. كما نجمع
            المعلومات الديموغرافية، التي قد لا تكون معلومات شخصية، مثل: الرمز
            البريدي، البلد، الجنس، اسم المستخدم، نوع الجهاز، معرف الجهاز الفريد،
            معلومات شبكة الهاتف المحمول، نظام التشغيل، المتصفح، إعدادات المنطقة
            الزمنية، موقع الجهاز، عنوان IP، سجل التصفح والبحث، بيانات المعاملات،
            والعمر أو تاريخ الميلاد.
          </p>
          <p>
            كما نقوم بجمع معلومات عامة حول استفسارات العملاء القانونية، بما في
            ذلك نوع الاستفسار وتفاصيله.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4">
            معلومات نجمعها من مصادر أخرى
          </h2>
          <p>
            قد نحصل على معلومات أيضاً من مصادر أخرى ودمجها مع المعلومات الشخصية
            التي تلقيناها منك أو جمعناها من خلال المنصة. على سبيل المثال:
          </p>
          <ul className="list-disc list-inside space-y-2 mr-6">
            <li>
              إذا اخترت ربط أو إنشاء أو تسجيل الدخول إلى حساب بشارة الخاص بك عبر
              مزود خدمات الدفع أو وسيلة تواصل اجتماعي، أو إذا كنت تتصل من خلال
              تطبيق أو موقع منفصل يستخدم واجهة معالجة التطبيق الخاصة بنا، فقد
              نحصل على معلومات عنك أو عن اتصالاتك.
            </li>
            <li>
              عند طلب خدمة عبر المنصة، قد يقوم مزود الخدمة بتزويدنا بتقييم حولك
              بعد تقديم الخدمة.
            </li>
          </ul>

          <h2 className="text-2xl font-semibold mt-8 mb-4">
            استخدام البيانات الشخصية
          </h2>
          <p>
            يمكننا استخدام المعلومات الشخصية التي تزودنا بها أو التي نجمعها منك
            للأغراض التالية:
          </p>
          <ul className="list-disc list-inside space-y-2 mr-6">
            <li>
              تزويد وصيانة وتحسين خدماتنا، يشمل ذلك على سبيل المثال، تسهيل طرق
              الدفع وإرسال الإيصالات وتقديم المنتجات والخدمات التي تطلبها
              (وإرسال معلومات ذات صلة)، وتطوير ميزات جديدة، وتقديم دعم العملاء
              للمستخدمين والمحامين، وتطوير ميزات الأمان.
            </li>
            <li>
              أداء العمليات والإدارة الداخلية، مثل منع الاحتيال وإساءة استخدام
              المنصة، واستكشاف أخطاء البرمجيات وحلها، وإجراء تحليل البيانات،
              والاختبار والبحث، ومراقبة وتحليل اتجاهات الاستخدام.
            </li>
            <li>إرسال أو تسهيل الاتصالات بينك وبين المحامي.</li>
            <li>
              إرسال معلومات نرى بأنها ذات أهمية بالنسبة لك، مثل تفاصيل حول
              منتجات وخدمات بشارة، والعروض الترويجية، والأخبار، والأحداث الخاصة
              بـ بشارة.
            </li>
            <li>إشعارك بأي تغييرات على المنصة أو خدماتها.</li>
            <li>السماح لك بالمشاركة في الميزات التفاعلية للمنصة.</li>
            <li>الحفاظ على المنصة آمنة ومحمية.</li>
            <li>
              تخصيص وتحسين تجربة الاستخدام، بما يشمل تقديم ميزات مخصصة، توصيات،
              محتوى، إعلانات ذات صلة.
            </li>
          </ul>

          <h2 className="text-2xl font-semibold mt-8 mb-4">
            تخزين ونقل البيانات الشخصية
          </h2>
          <p>
            أنت توافق على أننا نمتلك الحق في نقل البيانات الشخصية المبينة في
            سياسة الخصوصية هذه من وإلى، ومعالجتها وحفظها في الخوادم الخاصة بنا.
            وسوف نقوم باتخاذ التدابير اللازمة لحماية بياناتك الشخصية وفقاً
            لسياسة الخصوصية هذه. بتقديم بياناتك الشخصية، فإنك توافق على هذا
            النقل أو التخزين أو المعالجة.
          </p>
          <p>
            فيما يتعلق بالبيانات الشخصية المعالجة والمحفوظة والمنقولة من وإلى
            خوادمنا، تكون بشارة هي المتحكم بالبيانات لغرض الامتثال لقوانين حماية
            البيانات في المملكة العربية السعودية.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4">
            مشاركة البيانات الشخصية
          </h2>
          <p>
            قد نقوم بمشاركة البيانات الشخصية التي نجمعها عنك كما هو موضح في هذا
            البيان، ويشمل ذلك ما يلي:
          </p>
          <ul className="list-disc list-inside space-y-2 mr-6">
            <li>
              من خلال المنصة، يمكننا مشاركة بياناتك الشخصية مع المحامي عند تقديم
              استفسار. على سبيل المثال، قد نشارك اسمك ورقم جوالك و مدينتك و
              تفاصيل الاستفسار.
            </li>
            <li>
              مع أطراف ثالثة لتقديم خدمة قمت بطلبها من خلال شراكة أو عرض ترويجي
              مقدم بواسطة طرف ثالث أو من خلال بشارة.
            </li>
            <li>
              مع أطراف ثالثة تختار أنت السماح لنا بمشاركة بياناتك الشخصية معها.
            </li>
            <li>
              مع جهة العمل الخاصة بك وأي أطراف ثالثة ضرورية لمشاركة البيانات
              بواسطة بشارة أو من خلال جهة العمل.
            </li>
          </ul>

          <h2 className="text-2xl font-semibold mt-8 mb-4">
            حالات مشاركة أخرى
          </h2>
          <ul className="list-disc list-inside space-y-2 mr-6">
            <li>مع الكيانات التابعة والفرعية للمنصة.</li>
            <li>
              مع الوكلاء والاستشاريين وشركاء التسويق والإعلان، إضافة إلى مزودي
              الخدمات الآخرين.
            </li>
            <li>
              عند تلقي طلب رسمي من جهة مختصة إذا كنا نرى أن مشاركة هذه البيانات
              مطلوبة قانونياً.
            </li>
            <li>
              مع الجهات المكلفة بإنفاذ القانون أو أطراف أخرى لتطبيق الشروط
              والتحقيق في الانتهاكات المحتملة.
            </li>
            <li>خلال مفاوضات متعلقة بعمليات اندماج أو إعادة هيكلة أو تمويل.</li>
            <li>إذا تم إخطارك بذلك وأعطيت موافقتك على المشاركة.</li>
            <li>مع أطراف أخرى في شكل بيانات مجمّعة أو مجهولة المصدر.</li>
          </ul>

          <h2 className="text-2xl font-semibold mt-8 mb-4">حقوقك و خياراتك</h2>
          <p>
            يحق للعميل رفض استلام أي اتصالات تسويقية منا أو من شركائنا، كما
            يمكنه طلب عدم استخدام بياناته الشخصية أو حذفها من قاعدة بياناتنا.
            بالإضافة إلى ذلك، يحق له الوصول إلى أي معلومات محفوظة عنه، ويمكنه
            ممارسة هذا الحق من خلال المنصة.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4">حدود المسؤولية</h2>
          <p>
            منصة بشارة لا تقدم أي تعهدات أو ضمانات بشأن دقة أو اكتمال أو موثوقية
            المنصة أو أي من المعلومات المقدمة من خلالها. لا تتحمل أي مسؤولية عن
            الأضرار الناتجة عن استخدام المنصة، أو عدم توفرها بسبب مشكلات تقنية
            أو ظروف خارجة عن إرادتنا. استمرارك في استخدام المنصة بعد أي تعديل
            يعد موافقة منك على الشروط الجديدة.
          </p>
        </div>
      </div>
    </div>
  );
};

export default PrivacyPolicy;
