import SearchableCategories from './SearchableCategories';

const categories = [
  {
    id: 1,
    title: "الأحوال الشخصية (طلاق، حضانة)",
    mainDescription: "الاستشارات المتعلقة بقضايا الأسرة مثل: الطلاق، الحضانة",
    details: [
      "إعالة", "حاسبة ولي", "الولاية", "الحجر ورفع الحجر", "ثبات أو نفي نسب", "تسليم مستندات", "الهبة أو الرجوع عنها", "نشوز", "عضل (منع الفتاة من الزواج)", "حضانة", "أجرة حضانة", "زيارة محضون", "عش الزوجية", "خلع", "فسخ نكاح", "ثبات زواج", "طلاق", "نفقة"
    ]
  },
  {
    id: 2,
    title: "القضايا التجارية",
    mainDescription: "الاستشارات المتعلقة بجميع القضايا التجارية و فروعها",
    details: [
      "سمسرة", "الإفلاس", "الأنظمة التجارية", "التجارة الإلكترونية", "الضمان و التعويض", "الشروط الجزائية", "العقود التجارية", "عقود الخدمات", "عقود التشغيل", "إثبات شراكة", "وكالة تجارية", "نقل", "استيراد و تصدير", "تقسيط", "مقاولات", "بيع و شراء", "نزاعات شركاء"
    ]
  },
  {
    id: 3,
    title: "القضايا العمالية",
    mainDescription: "الاستشارات المتعلقة بالعامل أو صاحب العمل و حقوق كل منهما",
    details: [
      "إنهاء العلاقة العمالية", "استقالة", "فصل تعسفي", "مكافأة نهاية خدمة", "العقوبات التأديبية", "المستندات والوثائق وشهادة خبرة", "الأجور والرواتب والبدلات", "ساعات العمل الرسمية والعمل الإضافي", "إجازات", "الرعاية الصحية والتأمين الطبي", "إصابات العمل", "حقوق وواجبات العامل", "عقود العمل", "حقوق وواجبات صاحب العمل", "التعويضات"
    ]
  },
  {
    id: 4,
    title: "قضايا الجرائم المعلوماتية",
    mainDescription: "الاستشارات المتعلقة بالقضايا التي تتم عبر الوسائل الإلكترونية",
    details: [
      "الابتزاز الإلكتروني", "التشهير الإلكتروني", "الاختراق", "انتحال الشخصية", "التصيد", "الاحتيال الإلكتروني", "السرقة الإلكترونية", "التجسس الإلكتروني", "التهديد الإلكتروني"
    ]
  },
  {
    id: 5,
    title: "القضايا العقارية",
    mainDescription: "الاستشارات المتعلقة بجميع ما يخص العقار وحقوق البائع و المشتري",
    details: ["إثبات ملكية عقار", "إخلاء عقار", "بيع وشراء عقار", "أجرة عقار", "وساطة عقارية", "تداخل عقارات", "تعويض انتفاع من عقار", "فسخ عقد إيجار", "استرداد حيازة عقار"]
  },
  {
    id: 6,
    title: "قضايا التركات",
    mainDescription: "الاستشارات المتعلقة بالوراثة وما لهم من حقوق خلال قسمة التركة",
    details: ["قسمة تركات رضائية", "قسمة تركات إجبارية", "قسمة تركات العقار", "قسمة التركات الشركات", "حصر تركة", "تنازل عن نصيب في تركة", "محاسبة وكيل ورثة", "إثبات الوقف أو الوصية أو إبطالها", "إثبات استحقاق أو تسليمه", "محاسبة الناظر أو عزله", "الأوقاف"]
  },
  {
    id: 7,
    title: "القضايا الجنائية",
    mainDescription: "الاستشارات المتعلقة بالجرائم الجنائية وحقوق المتهم والضحية",
    details: ["غسيل أموال", "خطف", "التخبيب", "تشويه سمعة", "نصب و احتيال", "تستر تجاري", "غش تجاري", "شكاوى كيدية", "تهديد و ابتزاز", "رشوة", "تزوير", "انتحال شخصية", "شرب وتعاطي الممنوعات", "اعتداء أو إيذاء الغير", "تحرش", "قتل", "سرقة"]
  },
  {
    id: 8,
    title: "قضايا الأخطاء الطبية",
    mainDescription: "الاستشارات المتعلقة بحقوق المريض",
    details: ["الأخطاء الطبية", "شكوى ضد منشأة صحية", "مخالفة نظام مزاولة المهن الصحية", "التعويض عن الأخطاء الطبية"]
  },
  {
    id: 9,
    title: "قضايا الزكاة والضريبة",
    mainDescription: "الاستشارات المتعلقة بجميع النشاطات الخاضعة لنظام الزكاة و الضريبة",
    details: []
  },
  {
    id: 10,
    title: "القضايا الإدارية",
    mainDescription: "تشمل جميع أنواع الدعاوى الإدارية التي ترفع من جهة الإدارة أو ضدها",
    details: ["الوظائف الحكومية", "الغرامات الحكومية", "القرارات الإدارية", "عقود إدارية", "القضاء الإداري"]
  },
  {
    id: 11,
    title: "القضايا التأمينية",
    mainDescription: "تشمل الدعاوى التي تكون بين شركات التأمين والمستفيدين من أشخاص أو شركات",
    details: []
  },
  {
    id: 12,
    title: "القضايا التمويلية",
    mainDescription: "تشمل الدعاوى التي تخص شركات التمويل والبنوك وشركات الإيجار التمويلي وغيرها",
    details: []
  },
  {
    id: 13,
    title: "القضايا المرورية",
    mainDescription: "المطالبة الناشئة عن واقعة يكون أحد أطرافها مركبة متحركة وينتج عنها أضرار",
    details: ["مخالفات نظام المرور", "الحوادث المرورية", "تأمين المركبات"]
  },
  {
    id: 14,
    title: "قضايا النصب والاحتيال",
    mainDescription: "أي احتيال يتم بقصد الاستيلاء على أموال بدون إكراه",
    details: []
  },
  {
    id: 15,
    title: "قضايا الحقوق الشخصية",
    mainDescription: "القضايا التي يطالب فيها المدعي بحقوقه الخاصة",
    details: ["تحصيل ديون", "نزاعات مالية", "إثبات ملكية", "قرض", "بيع وشراء", "مخالفات الوكيل الشرعي", "مطالبات مالية", "الدعاوى المستعجلة"]
  },
  {
    id: 16,
    title: "قضايا الأوقاف والوصايا",
    mainDescription: "الدعاوى المقامة بشأن إثبات أو إبطال الوقف أو الوصية",
    details: []
  },
  {
    id: 17,
    title: "قضايا التنفيذ",
    mainDescription: "القضايا المتعلقة بتنفيذ الأحكام والقرارات",
    details: ["تنفيذ الأحكام القضائية", "تنفيذ السندات والشيكات", "إيقاف الخدمات", "منع السفر", "حجز الأموال", "أمر القبض", "الإعسار"]
  },
  {
    id: 18,
    title: "قضايا الملكية الفكرية",
    mainDescription: "حماية الحقوق الفكرية للأفراد والشركات",
    details: ["العلامات التجارية", "اعتراض على علامة تجارية", "حقوق المؤلف", "النشر والتوزيع", "براءات الاختراع"]
  }
];

export default function LegalSpecializations() {
  return (
    <div className="min-h-screen bg-gray-100 py-4">
        <div className="text-right lg:pr-16 pr-10 bg-blue-800 mt-10 py-10">
          <h1 className="text-xl  font-bold text-white sm:text-4xl lg:text-3xl">
            التخصصات القانونية
          </h1>
        </div>
      <div className="max-w-7xl mx-auto px-4 sm:px-6 lg:px-8">
        
        <SearchableCategories categories={categories} />
      </div>
    </div>
  );
}